Repository: marionline/wp-itheora
Catalog: lang/wpitheora-*.po
Languages: it_it

source: Wordpress itheora administration
it_it: Amministrazione wordpress itheora

source: Create player
it_it: Crea player

source: Options
it_it: Opzioni

source: ITheora is a PHP script allowing you to broadcast ogg/theora/vorbis only videos (and audios) files. It's simple to install and use. It may suit the usual blogger or the expert webmaster.
it_it: ITheora è uno script PHP che permette di distribuire file video (e audio) ogg/theora/vorbis. E' semplice da installare e usare. Utile dal semplice blogger al webmaster esperto.

source: Itheora is different from other software allowing to stream videos, because it offers other features for the user visiting the website:
it_it: Itheora è differente dagli altri software per lo streaming video perchè offre varie caratteristiche ai visitatori del sito web:

source: choose between watching videos in an embedded player (much like a flash player), and watch the video in your favorite media player (using a plugin)
it_it: scegliere tra vedere un video nel player integrato (come il player flash) o vedere il video con il media player preferito (usando un plugin)

source: download the video file
it_it: scaricare il file video

source: share the video by using the HTML source code available
it_it: condividere il video usando codice sorgente HTML disponibile

source: display in full screen mode
it_it: visualizzazione a tutto schermo

source: very quick display of the video.
it_it: visione del video veloce.

source: Itheora has real improvements for the webmaster :
it_it: Itheora valorizza i webmaster:

source: displaying a thumbnail when the player is being launched
it_it: visualizza un thumbnail quando il player è lanciato

source: almost complete interface customisation (skins, options, and languages)
it_it: offre una personalizzazione dell'interfaccia completa (tema, opzioni e lingue)

source: very simple XHTML-compliant code, easy to configure
it_it: codice XHTML semplice e facile da configurare

source: download possible by peer-to-peer (Bittorrent or Coral)
it_it: scaricamento tramite peer-to-peer (Bittorrent o Coral)

source: streaming in real time and playing external videos (on an other server with http or ftp protocol)
it_it: streaming in tempo reale ed esecuzione di un video esterno (da un altro server con protocollo http o ftp)

source: playlist (free format .xspf) or ogg podcast can be used
it_it: possono essere usate playlist (formato livero .xspf) o podcast ogg

source: support the html5 tag video
it_it: supporto al tag video html5

source: a code generator make easier the configuration
it_it: il creatore del codice rende facile la configurazione

source: fall back on flash is possible
it_it: tornare indietro a flash è possibile

source: This software is like an alternative to the proprietary Flash players (file format and software), and is based on the Cortado java applet (ITheora is not a simple wrapper for Cortado), and helps the spreading of ogg/theora free (as in freedom ;) ) format.
it_it: Questo software è una alternativa al player Flash proprietario (formato flash e software) ed è basato sull'applet java Cortado (ITheora non è un semplice wrapper di Cortado) e aiuta a distribuire il formato ogg/theora (in libertà ;) ).

source: In the same time, it allows you to be independant from online video services, such as youtube and dailymotion, because you can share the source code of the video from a blogger to another.
it_it: Allo stesso tempo permette di essere indipendenti da un servizio video online come youtube o dailymotion, perchè si può condividere il sorgente del video tra blogger.

source: Theora Sea is a sharing video area. This area is a simple list of links which target to hosted video, you cannot upload videos on this site. However, it make easier to generate podcast.
it_it: Theora Sea Theora Sea è una area di condivisione video. Quest'area è una semplice lista di collegamenti che puntano a dei video, non si possono caricare video su questo sito web. Comunque rende facile la generazione di podcast.

source: So you can submit videos that you host yourself, yet know that you are the unique liable of what you broadcast. Check that you respect copyright low of your country.
it_it: Si possono inviare i video che si stanno ospitando, si è gli unici responsabile di ciò che si trasmette. Controllare di rispettare la legge sul copyright del proprio paese.
